[{"premises":["You should not hurt someone without a good reason.","If you do something for petty reasons, you aren't doing it for a good reason.","Road rage is petty.","Jake cut Chris off in traffic, and that enraged Chris.","Chris was so angry that he followed Jake to a stop light, got out of his car and punched Jake.","Road rage is anger over driving."],"intermediates":[{"inputs":["p3","p4"],"output":"Chris punched Jake because he was angry at Jake cutting him off in traffic."},{"inputs":["i0","p5"],"output":"Chris punched Jake because of his road rage."},{"inputs":["p2","i1"],"output":"Chris punched Jake for a petty reason."},{"inputs":["p1","i2"],"output":"Chris punched Jake without a good reason."},{"inputs":["p0","i3"],"output":"Chris should not have punched Jake."}],"hypothesis":"Chris should not have punched Jake."},{"premises":["Stealing is taking something without the owner's permission.","Caleb left Target with a pack of trading cards in his pocket.","Caleb didn't pay for the pack.","You only have permission to take merchandise from a store if you pay for it.","You should not steal."],"intermediates":[{"inputs":["p1","p2"],"output":"Caleb took the cards from Target without paying for them."},{"inputs":["i0","p3"],"output":"Caleb took the store's cards without the store's permission."},{"inputs":["p0","i1"],"output":"Caleb stole the cards."},{"inputs":["i2","p4"],"output":"Caleb should not have stolen the cards."}],"hypothesis":"Caleb should not have stolen the cards."},{"premises":["Elias ran into Julia and made her drop all her books.","If you drop something accidentally, you need to pick it up afterwards.","If you caused an accident, you should help anyone affected by it."],"intermediates":[{"inputs":["p0","p1"],"output":"Julia needs to pick up the books because Elias bumped into her."},{"inputs":["i0","p2"],"output":"Elias should help Julia pick up the books."}],"hypothesis":"Elias should help Julia pick up the books."},{"premises":["In the United States, it's impolite to not tip someone who serves you.","A bartender serves drinks at a bar.","Ellie ordered a drink at a bar called the Red Pony.","The Red Pony is in Albuquerque, New Mexico.","New Mexico is a state in the United States.","You should not do impolite things."],"intermediates":[{"inputs":["p0","p1"],"output":"In the United States, it's impolite to not tip bartenders who serve you drinks at a bar."},{"inputs":["p2","p1"],"output":"Ellie ordered a drink from a bartender at the Red Pony."},{"inputs":["p3","p4"],"output":"The Red Pony is in the United States."},{"inputs":["i1","i2"],"output":"Ellie ordered a drink from a bartender in the United States."},{"inputs":["i0","i3"],"output":"It would be impolite for Ellie to not tip the bartender."},{"inputs":["i4","p5"],"output":"Ellie should tip the bartender."}],"hypothesis":"Ellie should tip the bartender."},{"premises":["You should pay back your debts.","Fred borrowed $100 from Alyssa to buy the ski lift ticket.","You remind someone to do something when you want them to do it but they haven't.","Alyssa messaged Fred to remind him to pay her back for the ski lift ticket.","If you borrow something from someone and haven't given it back, you owe it to them."],"intermediates":[{"inputs":["p2","p3"],"output":"Fred hasn't paid Alyssa back for the ski lift ticket yet."},{"inputs":["p1","i0"],"output":"Fred borrowed $100 from Alyssa and hasn't paid it back yet."},{"inputs":["i1","p4"],"output":"Fred owes Alyssa $100."},{"inputs":["p0","i2"],"output":"Fred should pay Alyssa $100."}],"hypothesis":"Fred should pay Alyssa $100."},{"premises":["You should not take something that doesn't belong to you.","Mark is considering taking the lunch in the breakroom fridge.","The lunch in the fridge has a note on it saying \"Melissa\".","People write their names on things to mark them as their belongings."],"intermediates":[{"inputs":["p2","p3"],"output":"The lunch in the breakroom fridge is Melissa's."},{"inputs":["p1","i0"],"output":"Mark is considering taking Melissa's lunch."},{"inputs":["p0","i1"],"output":"Mark should not take Melissa's lunch."}],"hypothesis":"Mark should not take Melissa's lunch."},{"premises":["Fern brought her textbook to class.","Ann showed up to biology class without her textbook.","Textbooks are required in Ann's biology class.","You should share things with people in need."],"intermediates":[{"inputs":["p1","p2"],"output":"Ann needs a textbook."},{"inputs":["i0","p3"],"output":"Someone should share a textbook with Ann."},{"inputs":["p0","i1"],"output":"Fern should share her textbook with Ann."}],"hypothesis":"Fern should share her textbook with Ann."},{"premises":["Someone in a red BMW was waiting for the parking spot before George.","If a group of people is waiting for something, the people who were waiting earliest are first in line.","You should let people ahead of you in line go first.","When you take something, you prevent other people from taking it.","George is about to take the parking spot."],"intermediates":[{"inputs":["p0","p1"],"output":"Someone in a red BMW is in line for the parking spot ahead of George."},{"inputs":["i0","p2"],"output":"George should let the person in the red BMW take the parking spot."},{"inputs":["p3","p4"],"output":"If George takes the parking spot, he will prevent other people from taking it."},{"inputs":["i1","i2"],"output":"George shouldn't take the parking spot."}],"hypothesis":"George shouldn't take the parking spot."},{"premises":["Embezzlement is theft or misappropriation of funds belonging to an employer.","Using money allotted for one purpose for another purpose is misappropriation.","Tessa works as an accountant at her firm.","A retiree is someone who has retired from employment and is no longer working.","Tessa withdrew a lump sum from her firm's retirement fund to buy herself a summer home.","Money in a company's retirement fund is intended to be paid out to retirees."],"intermediates":[{"inputs":["p2","p3"],"output":"Tessa is not a retiree."},{"inputs":["p4","p5"],"output":"Tessa bought herself a summer home with money from the firm intended for retirees."},{"inputs":["i0","i1"],"output":"Tessa bought herself a summer home with money from the firm that was not intended for her."},{"inputs":["p1","i2"],"output":"Tessa misappropriated her firm's money."},{"inputs":["p0","i3"],"output":"Tessa embezzled from her firm."}],"hypothesis":"Tessa embezzled from her firm."},{"premises":["Leading others to think someone was responsible for something is shifting the blame.","When the campus cops interviewed Nate after the fire, he said he saw Jeff drop a cigarette.","Telling someone that something happened leads them to believe it happened.","Dropping a cigarette can cause a fire.","Letting someone else take the blame for your actions is wrong.","Nate dropped the cigarette that started the fire."],"intermediates":[{"inputs":["p1","p2"],"output":"Nate led the campus cops to believe that Jeff dropped a cigarette before the fire."},{"inputs":["i0","p3"],"output":"Nate led the campus cops to believe that Jeff started the fire."},{"inputs":["p0","i1"],"output":"Nate shifted the blame for the fire to Jeff."},{"inputs":["p4","p5"],"output":"It would be wrong for Nate to let someone else take the blame for starting the fire."},{"inputs":["i2","i3"],"output":"Nate should not have shifted the blame for the fire to Jeff."}],"hypothesis":"Nate should not have shifted the blame for the fire to Jeff."},{"premises":["Taking something that doesn't belong to you is wrong.","The TV belonged to the owners of the AirBNB Mike was staying at.","You shouldn't help someone do something wrong.","Tim helped Mike carry the TV out to his car."],"intermediates":[{"inputs":["p0","p1"],"output":"It would be wrong for Mike to take the TV."},{"inputs":["i0","p2"],"output":"It would be wrong to help Mike take the TV."},{"inputs":["i1","p3"],"output":"Tim shouldn't have helped Mike take the TV."}],"hypothesis":"Tim shouldn't have helped Mike take the TV."},{"premises":["The right thing to do is whatever results in the least harm.","If you don't push the old lady, the truck will hit her.","Getting hit by a vehicle is likely to cause serious injury or death.","Pushing the old lady will likely give her minor injuries at worst."],"intermediates":[{"inputs":["p1","p2"],"output":"If you don't push the old lady, she will suffer a serious injury or die."},{"inputs":["i0","p3"],"output":"If you push the old lady, she will suffer less harm than if you don't."},{"inputs":["p0","i1"],"output":"You should push the old lady."}],"hypothesis":"You should push the old lady."},{"premises":["Emily told Cassandra to copy her homework so that Cassandra wouldn't get in trouble.","Copying homework is cheating.","Cheating is wrong.","Telling someone to do something is influencing them to do it.","You shouldn't influence someone to do something wrong."],"intermediates":[{"inputs":["p1","p2"],"output":"Copying homework is wrong."},{"inputs":["p3","p4"],"output":"You shouldn't tell someone to do something wrong."},{"inputs":["i0","i1"],"output":"You shouldn't tell someone to copy homework."},{"inputs":["p0","i2"],"output":"Emily should not have told Cassandra to copy her homework."}],"hypothesis":"Emily should not have told Cassandra to copy her homework."},{"premises":["Making out with someone is an intimate act.","Mark recorded Jess making out with someone while she was drunk.","You need to be aware that something is happening in order to consent to it.","Jess wasn't aware that Mark was filming her.","You shouldn't record someone in a compromising situation without their consent.","A compromising situation is one which could cause embarrassment or shame if made public.","Physical intimacy can be embarrassing if it's made public."],"intermediates":[{"inputs":["p0","p1"],"output":"Mark recorded Jess being intimate with someone while she was drunk."},{"inputs":["p2","p3"],"output":"Jess did not consent to Mark filming her."},{"inputs":["i0","i1"],"output":"Mark recorded Jess being intimate with someone without her consent."},{"inputs":["p5","p6"],"output":"Physical intimacy is a compromising situation."},{"inputs":["p4","i3"],"output":"You shouldn't record someone being physically intimate without their consent."},{"inputs":["i2","i4"],"output":"Mark should not have recorded Jess."}],"hypothesis":"Mark should not have recorded Jess."},{"premises":["Putting yourself or others at unnecessary risk is reckless.","You should not behave recklessly.","Taking a right at a red light involves entering a crossing lane.","Checking for traffic in a lane before entering it reduces the risk of a collision.","If you could do something to reduce risk, but you don't, you're exposing yourself to avoidable risk."],"intermediates":[{"inputs":["p0","p1"],"output":"You should not put yourself or others at unnecessary risk."},{"inputs":["p2","p3"],"output":"Checking for traffic in the crossing lane before taking a right at a red light reduces the risk of a collision."},{"inputs":["i1","p4"],"output":"Not checking for traffic in the crossing lane before taking a right at a red light exposes you to avoidable risk."},{"inputs":["i0","i2"],"output":"You should check for traffic in the crossing lane before taking a right at a red light."}],"hypothesis":"You should check for traffic in the crossing lane before taking a right at a red light."},{"premises":["Adding pieces to the board is against the rules of chess.","Breaking the rules is cheating.","You shouldn't cheat.","When Ben's opponent wasn't looking, Ben snuck a pawn onto the board to give himself the advantage."],"intermediates":[{"inputs":["p0","p1"],"output":"Adding pieces to the board is cheating."},{"inputs":["i0","p2"],"output":"You shouldn't add pieces to the board."},{"inputs":["i1","p3"],"output":"Ben shouldn't have put the pawn on the board."}],"hypothesis":"Ben shouldn't have put the pawn on the board."},{"premises":["Safe driving requires your full attention.","Jared checked his phone while pulling onto the freeway.","Checking your phone takes your attention off of whatever else you're doing.","If something prevents you from doing the right thing, it's wrong.","You should always drive safe."],"intermediates":[{"inputs":["p1","p2"],"output":"Jared took his attention off of driving to check his phone."},{"inputs":["p0","i0"],"output":"Checking his phone prevented Jared from driving safely."},{"inputs":["p3","p4"],"output":"You shouldn't do anything that prevents you from driving safe."},{"inputs":["i1","i2"],"output":"Jared should not have checked his phone."}],"hypothesis":"Jared should not have checked his phone."},{"premises":["There are some people who haven't gotten a slice yet.","Taking a second portion before someone else has gotten a first portion is unfair.","You want to take a second slice of pizza.","If you want to do something, but it's too soon, you should wait."],"intermediates":[{"inputs":["p0","p1"],"output":"It's too soon to take a second slice."},{"inputs":["i0","p2"],"output":"You want to take a slice of pizza but it's too soon."},{"inputs":["i1","p3"],"output":"You should wait before taking a second slice of pizza."}],"hypothesis":"You should wait before taking a second slice of pizza."},{"premises":["Murder means killing someone with premeditation.","Premeditation means thinking through something before doing it.","David bought anthrax, then used it to try and kill Ingrid.","Buying supplies for something is part of planning for something."],"intermediates":[{"inputs":["p2","p3"],"output":"David planned to kill Ingrid before trying to kill her."},{"inputs":["p1","i0"],"output":"David tried to kill Ingrid in a premeditated way."},{"inputs":["p0","i1"],"output":"David tried to murder Ingrid."}],"hypothesis":"David tried to murder Ingrid."},{"premises":["It's a faux pas to offer someone something they can't accept.","Maria is pregnant.","People who are pregnant shouldn't drink alcohol.","Beer is an alcoholic beverage."],"intermediates":[{"inputs":["p2","p3"],"output":"People who are pregnant shouldn't drink beer."},{"inputs":["p1","i0"],"output":"Maria shouldn't drink beer."},{"inputs":["p0","i1"],"output":"It would be a faux pas to offer Maria a beer."}],"hypothesis":"It would be a faux pas to offer Maria a beer."},{"premises":["Sandy tripped and spilled her hot coffee on Chris.","When someone spills hot coffee on you, it hurts.","If someone does something that harms you, you will get angry at them.","If you did not mean for something to happen, it was a mistake.","Sandy did not mean to spill her coffee.","Even if you are mad at someones mistake, you should forgive them."],"intermediates":[{"inputs":["p1","p2"],"output":"Having hot coffee spilled onto you will make you angry at someone."},{"inputs":["p0","i0"],"output":"Chris got mad at Sandy because Sandy's hot coffee spilled on Chris."},{"inputs":["p3","p4"],"output":"Sandy spilling her coffee was an mistake."},{"inputs":["i1","i2"],"output":"Sandy's mistake made Chris angry at Sandy."},{"inputs":["i3","p5"],"output":"Chris should forgive Sandy."}],"hypothesis":"Chris should forgive Sandy."},{"premises":["You can't score well on a test without studying for it unless you cheat.","Brad scored well on his test.","Brad did not study the material on the test.","Cheating is dishonest.","You should be honest."],"intermediates":[{"inputs":["p1","p2"],"output":"Brad scored well on his test without studying for it."},{"inputs":["p0","i0"],"output":"Brad cheated on his test."},{"inputs":["p3","p4"],"output":"You should not cheat."},{"inputs":["i1","i2"],"output":"Brad should not have cheated on his test."}],"hypothesis":"Brad should not have cheated on his test."},{"premises":["You should not litter.","Littering is when you throw trash outside of a trash bin.","Johnny threw trash on the floor.","Johnny did not want to walk to the far away trash bin."],"intermediates":[{"inputs":["p2","p3"],"output":"Johnny did not throw his trash away into a trash bin."},{"inputs":["p1","i0"],"output":"Johnny littered."},{"inputs":["p0","i1"],"output":"Johnny should not have littered."}],"hypothesis":"Johnny should not have littered."},{"premises":["If you see someone struggling to do something, you should help them.","Josh is holding groceries in both hands at the door.","If you are holding something with both hands, you will struggle to open doors.","Amy can see Josh."],"intermediates":[{"inputs":["p1","p2"],"output":"Josh is struggling to open the door."},{"inputs":["i0","p3"],"output":"Amy can see Josh struggling to open the door."},{"inputs":["p0","i1"],"output":"Amy should help Josh open the door."}],"hypothesis":"Amy should help Josh open the door."},{"premises":["You should avoid harming someone else or yourself.","Driving dangerously can harm you or someone else.","Dani drove home from the bar after drinking alcohol.","Driving after drinking alcohol is dangerous."],"intermediates":[{"inputs":["p2","p3"],"output":"Dani drove home dangerously."},{"inputs":["p1","i0"],"output":"Dani could have harmed themself or someone else by driving home."},{"inputs":["p0","i1"],"output":"Dani should not have driven home."}],"hypothesis":"Dani should not have driven home."},{"premises":["You should not copy other peoples work and claim it as your own.","Copyright infringement is using protected works of another person without permission.","Ryan did not ask the band Super Cool for permission to use their song.","Ryan made a video.","Ryan used a song from the band Super Cool in the video.","All songs by Super Cool are protected work."],"intermediates":[{"inputs":["p0","p1"],"output":"You should not copy protected work from other people because that's copyright infringement."},{"inputs":["p3","p4"],"output":"Ryan made a video and used a song from a band called Super Cool."},{"inputs":["p2","i1"],"output":"Ryan used Super Cool's song without getting permission from the band first."},{"inputs":["i2","p5"],"output":"Ryan used Super Cool's protected work without getting permission from the band first."},{"inputs":["i0","i3"],"output":"Ryan should not have used Super Cool's song because he committed copyright infringement."}],"hypothesis":"Ryan should not have used Super Cool's song because he committed copyright infringement."},{"premises":["Scaring people is mean and rude unless you have a good reason.","You generally do not want to do mean or rude things to people.","Luke yelled fire for fun.","Yelling fire for fun is not a good reason to yell fire.","When you yell fire for without a good reason, you scare everyone around you."],"intermediates":[{"inputs":["p0","p1"],"output":"You should not scare people without good reason."},{"inputs":["p2","p3"],"output":"Luke yelled fire without a good reason."},{"inputs":["i1","p4"],"output":"Luke scared everyone around him without a good reason."},{"inputs":["i0","i2"],"output":"Luke should not have yelled fire."}],"hypothesis":"Luke should not have yelled fire."},{"premises":["Even though you won't be punished, you should not do bad things.","If no one sees you do something bad, you won't get punished.","Mike can steal the wallet.","When you turn away from something you cannot see it.","Josh turned away from Mike and the wallet.","Stealing is bad."],"intermediates":[{"inputs":["p3","p4"],"output":"Josh turned away and cannot see Mike or the wallet."},{"inputs":["p2","i0"],"output":"Mike can steal the wallet without Josh seeing."},{"inputs":["i1","p5"],"output":"Mike can do something bad without Josh seeing."},{"inputs":["p1","i2"],"output":"Mike can do something bad without getting punished."},{"inputs":["p0","i3"],"output":"Mike should not do something bad even though he will not get punished."}],"hypothesis":"Mike should not do something bad even though he will not get punished."},{"premises":["You should clean messes you create.","If you made a spill, you made a mess.","Amy dropped her ice-cream on the floor and did not clean it.","If you drop ice cream on the floor, you make a spill."],"intermediates":[{"inputs":["p0","p1"],"output":"You should clean spills you made."},{"inputs":["p2","p3"],"output":"Amy made a spill and did not clean it."},{"inputs":["i0","i1"],"output":"Amy should have cleaned her spill."}],"hypothesis":"Amy should have cleaned her spill."},{"premises":["Helping hurt animals is a good thing to do.","If you mend something, you are helping the thing that something belongs to.","Setting a cast is a way to mend a wound.","Dan put a cast around the hurt dogs broken leg."],"intermediates":[{"inputs":["p2","p3"],"output":"Dan mended the hurt dog's leg."},{"inputs":["p1","i0"],"output":"Dan helped the hurt dog."},{"inputs":["p0","i1"],"output":"Dan did a good thing."}],"hypothesis":"Dan did a good thing."},{"premises":["You should not annoy other people.","Loud music will cause other people that are around to be annoyed.","Ned is playing music loudly.","Ned and Brad are around each other."],"intermediates":[{"inputs":["p0","p1"],"output":"You should not play loud music with other people around because it will annoy them."},{"inputs":["p2","p3"],"output":"Ned is playing his music loud around Brad."},{"inputs":["i0","i1"],"output":"Ned should not play his music because it will annoy Brad."}],"hypothesis":"Ned should not play his music because it will annoy Brad."},{"premises":["Forcing someone to give you something is wrong.","You should not do wrong things.","Keith bullied Gunner until Gunner gave his lunch money to Keith.","Bullying is a form of harassment.","If you continuously harass someone until they do something, you forced them to do that thing."],"intermediates":[{"inputs":["p0","p1"],"output":"You should not force someone to give you something."},{"inputs":["p2","p3"],"output":"Keith harassed Gunner until Gunner gave his lunch money to Keith."},{"inputs":["i1","p4"],"output":"Keith forced Gunner to give Keith his lunch money."},{"inputs":["i0","i2"],"output":"Keith should not have forced Gunner to give Keith his lunch money."}],"hypothesis":"Keith should not have forced Gunner to give Keith his lunch money."},{"premises":["If you agree to do something, you should do it.","Chad agreed to work but is playing instead.","If you agree to do something but are doing something else, you are not doing what you agreed to do."],"intermediates":[{"inputs":["p1","p2"],"output":"Chad agreed to work but is not working."},{"inputs":["p0","i0"],"output":"Chad should be working."}],"hypothesis":"Chad should be working."},{"premises":["Lewis earned wages over the year.","If you earn wages over the year, you have taxes on those wages.","Paying taxes is a law.","You should obey the law.","Breaking the law is a crime."],"intermediates":[{"inputs":["p0","p1"],"output":"Lewis has taxes on wages he earned over the year."},{"inputs":["p2","p3"],"output":"Paying taxes is a law that you should obey."},{"inputs":["i1","p4"],"output":"It is a crime to not pay your taxes."},{"inputs":["i0","i2"],"output":"Lewis will commit a crime if he does not pay his taxes."}],"hypothesis":"Lewis will commit a crime if he does not pay his taxes."},{"premises":["You should fulfill your promises.","Evan said he would help Rose.","If you say you will do something, you promise to do that thing."],"intermediates":[{"inputs":["p1","p2"],"output":"Evan promised to help Rose."},{"inputs":["p0","i0"],"output":"Evan should help Rose."}],"hypothesis":"Evan should help Rose."},{"premises":["Erin argued for her answer after it was proven wrong.","If you argue when you are wrong, you do not accept that you are wrong.","If you can't accept that you are wrong, you lack humility.","You should have humility."],"intermediates":[{"inputs":["p0","p1"],"output":"Erin did not accept that she was wrong."},{"inputs":["i0","p2"],"output":"Erin lacks humility."},{"inputs":["i1","p3"],"output":"Erin should have humility."}],"hypothesis":"Erin should have humility."},{"premises":["You should not intentionally mislead people.","You knowingly told John incorrect information.","If you do something that you know is incorrect, you did that on purpose.","Telling someone incorrect information is misleading them.","If you do something on purpose, you did that thing intentionally."],"intermediates":[{"inputs":["p1","p2"],"output":"You told John incorrect information on purpose."},{"inputs":["i0","p3"],"output":"You misled John on purpose."},{"inputs":["i1","p4"],"output":"You intentionally misled John."},{"inputs":["p0","i2"],"output":"You should not have misled John intentionally."}],"hypothesis":"You should not have misled John intentionally."},{"premises":["You should only fire someone if you have a good reason.","Bob fired Peter because Peter had different ideas than Bob.","If two people have different ideas, they do not agree with each other.","Not agreeing with someone is not a good reason to fire them."],"intermediates":[{"inputs":["p1","p2"],"output":"Bob fired Peter because they do not agree."},{"inputs":["i0","p3"],"output":"Bob fired Peter without a good reason."},{"inputs":["p0","i1"],"output":"Bob should not have fired Peter."}],"hypothesis":"Bob should not have fired Peter."},{"premises":["Superiors give orders and expect you to follow them.","If an order is unjust, you should disobey those orders.","If you follow an order to commit a crime, you followed an unjust order.","If you did the thing you are ordered to do from someone else, you followed the order given by that someone.","If a superior tells you to do something, that thing is an order.","Sara committed fraud because her boss told her to.","Fraud is a crime.","If someone is your boss, then they are your superior."],"intermediates":[{"inputs":["p0","p1"],"output":"You should disobey orders from superiors if they are unjust."},{"inputs":["p5","p6"],"output":"Sara committed a crime  because her boss told her to."},{"inputs":["i1","p7"],"output":"Sara committed a crime  because her superior told her to."},{"inputs":["p4","i2"],"output":"Sara committed a crime because her superior ordered her to."},{"inputs":["p3","i3"],"output":"Sara followed her order to commit a crime given by her superior."},{"inputs":["p2","i4"],"output":"Sara followed an unjust order given by her superior."},{"inputs":["i0","i5"],"output":"Sara should have disobeyed her superiors unjust orders."}],"hypothesis":"Sara should have disobeyed her superiors unjust orders."},{"premises":["If you are cheating, you should tell your partner and stop cheating.","Stan is seeing Olivia but is partnered with Ellie.","If you are seeing someone other than your partner, then you are cheating on your partner."],"intermediates":[{"inputs":["p1","p2"],"output":"Stan is cheating on his partner."},{"inputs":["p0","i0"],"output":"Stan should stop cheating and tell his partner."}],"hypothesis":"Stan should stop cheating and tell his partner."},{"premises":["If you hurt someone over a rude remark then you lost your temper.","Jake punched Jim when Jim said Jake's shirt was stupid.","Saying something is stupid is considered a rude remark.","You should control your emotions and not hurt someone because you lost your temper."],"intermediates":[{"inputs":["p1","p2"],"output":"Jake punched Jim when Jim made a rude remark about Jake's shirt."},{"inputs":["p0","i0"],"output":"Jake lost his temper and hurt Jim over a rude remark."},{"inputs":["i1","p3"],"output":"Jake should have controlled his emotions and not hurt Jim."}],"hypothesis":"Jake should have controlled his emotions and not hurt Jim."},{"premises":["Henry moved his golf ball out of the rough.","Henry didn't take a penalty stroke or tell anyone when he was moving his ball.","In golf, if you move your ball without telling anyone or taking a penalty stroke, you cheat.","Cheating in a game is disrespectful to the other players."],"intermediates":[{"inputs":["p0","p1"],"output":"Henry moved his golf ball out of the rough without telling anyone or taking a penalty stroke."},{"inputs":["i0","p2"],"output":"Henry cheated at golf."},{"inputs":["i1","p3"],"output":"Henry disrespected the other golf players."}],"hypothesis":"Henry disrespected the other golf players."},{"premises":["Oswald realized his stocks would soon be worthless, putting him in debt.","To avoid debt, Oswald sold his stocks to other people.","It is deceitful to sell something when it has no value.","You should not do deceitful things."],"intermediates":[{"inputs":["p0","p1"],"output":"Oswald sold stocks that he knew had no value to other people."},{"inputs":["p2","p3"],"output":"If you know something has no value, you should not sell that thing."},{"inputs":["i0","i1"],"output":"Oswald should not have sold those stocks."}],"hypothesis":"Oswald should not have sold those stocks."},{"premises":["Jeff took candy from a child in the park.","Children are often considered helpless due to their age.","Stealing from the helpless is taking advantage of them.","Taking advantage of someone is considered being cruel."],"intermediates":[{"inputs":["p0","p1"],"output":"Jeff took candy from a helpless child in the park."},{"inputs":["p2","p3"],"output":"Stealing from the helpless is considered being cruel."},{"inputs":["i0","i1"],"output":"It was cruel of Jeff to steal candy from the child."}],"hypothesis":"It was cruel of Jeff to steal candy from the child."},{"premises":["Lois let her dog poop on her neighbors lawn.","Lois never picks up her dog's poop because she thinks it's gross.","Leaving a mess requires someone else to clean it.","Dog poop is a mess.","It is inconsiderate to make someone else account for your responsibilities.","Avoiding your responsibilities requires someone else to account for them."],"intermediates":[{"inputs":["p0","p1"],"output":"Lois did not pick up her dog's poop on the neighbors lawn."},{"inputs":["p2","p3"],"output":"Dog poop is a mess that needs to be cleaned by someone."},{"inputs":["i0","i1"],"output":"Lois left a mess that needs to be cleaned by someone."},{"inputs":["p4","p5"],"output":"Avoiding your responsibilities is inconsiderate."},{"inputs":["p2","p5"],"output":"You are avoiding your responsibilities when you leave a mess for someone else."},{"inputs":["i3","i4"],"output":"Leaving a mess for someone else to clean is being inconsiderate."},{"inputs":["i2","i5"],"output":"Lois is inconsiderate."}],"hypothesis":"Lois is inconsiderate."},{"premises":["Joshua likes driving an extremely loud car in the middle of the night because it wakes people up.","Making things unpleasant for someone is rude.","Waking someone up at night prevents them from getting a full night's rest.","Not getting a full night's rest is unpleasant.","If you like to be rude, you're a rude person."],"intermediates":[{"inputs":["p2","p3"],"output":"Waking someone up at night can be unpleasant for that person."},{"inputs":["p1","i0"],"output":"It is rude to wake people up at night."},{"inputs":["p0","i1"],"output":"Joshua likes to be rude."},{"inputs":["i2","p4"],"output":"Joshua is a rude person."}],"hypothesis":"Joshua is a rude person."},{"premises":["Katie used her neighbors' internet access without their permission.","Using someone's internet access doesn't prevent them from using it.","It's wrong to deprive someone of their property."],"intermediates":[{"inputs":["p0","p1"],"output":"Katie didn't deprive her neighbors of their internet by using it without their permission."},{"inputs":["i0","p2"],"output":"It was okay for Katie to use her neighbors' internet."}],"hypothesis":"It was okay for Katie to use her neighbors' internet."},{"premises":["Pushing people out of your way is an impatient thing to do.","Patience is a virtue.","People should be virtuous.","Letty shoved Cathleen out of the way when walking through a doorway."],"intermediates":[{"inputs":["p1","p2"],"output":"People should be patient."},{"inputs":["p0","i0"],"output":"You shouldn't push people out of your way."},{"inputs":["i1","p3"],"output":"Letty should not have shoved Cathleen."}],"hypothesis":"Letty should not have shoved Cathleen."},{"premises":["The professor hugged the student without asking permission.","It is not respectful to do things to people without their permission.","You should respect people."],"intermediates":[{"inputs":["p0","p1"],"output":"It was disrespectful of the professor to hug the student."},{"inputs":["i0","p2"],"output":"The professor should not have hugged the student."}],"hypothesis":"The professor should not have hugged the student."},{"premises":["Knowing the paper's authors does not reflect the paper's merit.","You should score \npapers based on merit.","Andy gave a high score to the paper because he knew the authors."],"intermediates":[{"inputs":["p0","p1"],"output":"Giving a high score to a paper because you know the authors is wrong."},{"inputs":["i0","p2"],"output":"Andy should not have scored the paper based on how well he knew the authors."}],"hypothesis":"Andy should not have scored the paper based on how well he knew the authors."},{"premises":["Throwing things out of frustration is an example of having a temper tantrum.","People should not let their emotions get out of control.","Having a temper tantrum in public means you are not in control of your emotions.","Martha threw a chair out of frustration while she was at the DMV.","The DMV is a public location."],"intermediates":[{"inputs":["p1","p2"],"output":"People should not have temper tantrums in public."},{"inputs":["p0","i0"],"output":"People shouldn't throw things in public out of frustration."},{"inputs":["p3","p4"],"output":"Martha thew a chair out of frustration in public."},{"inputs":["i1","i2"],"output":"Martha should not have thrown the chair."}],"hypothesis":"Martha should not have thrown the chair."},{"premises":["Not helping someone in trouble is allowing a bad thing to happen to them.","Allowing a bad thing to happen to someone is considered harming them.","You should not do something that harms someone else.","Joey cried out for help when he was being bullied.","Jan heard Joey but didn't do anything."],"intermediates":[{"inputs":["p0","p1"],"output":"Not helping someone in trouble is considered harming them."},{"inputs":["i0","p2"],"output":"You should help people in trouble."},{"inputs":["p3","p4"],"output":"Jan heard Joey crying for help but didn't do anything."},{"inputs":["i1","i2"],"output":"Jan should have helped Joey."}],"hypothesis":"Jan should have helped Joey."},{"premises":["Mark took his kids out of school to help him beg other people for money.","Asking people for money is a way to make money.","Removing your kids from school is detrimental to them.","To exploit someone is the action or fact of treating someone unfairly in order to benefit from their work.","You should treat people fairly."],"intermediates":[{"inputs":["p0","p1"],"output":"Mark took his kids out of school to help him make money."},{"inputs":["i0","p2"],"output":"Mark is using his children to get money at their expense."},{"inputs":["i1","p3"],"output":"Mark is exploiting his children."},{"inputs":["p3","p4"],"output":"You should not exploit people."},{"inputs":["i2","i3"],"output":"Mark should not be exploiting his children."}],"hypothesis":"Mark should not be exploiting his children."},{"premises":["Deciding not to hire someone on the basis of their traits is one kind of discrimination.","It is unjust to discriminate on the basis of pregnancy.","You should treat people justly.\n","Victor did not hire Maddie because she was going on maternity leave soon.","If someone is going on maternity leave then they are pregnant."],"intermediates":[{"inputs":["p1","p2"],"output":"You shouldn't discriminate on the basis of pregnancy."},{"inputs":["p0","i0"],"output":"You shouldn't base hiring decisions off of whether or not someone is pregnant."},{"inputs":["p3","p4"],"output":"Victor decided not to hire Maddie based on her pregnancy."},{"inputs":["i1","i2"],"output":"Victor should not have based his decision off of Maddie's pregnancy."}],"hypothesis":"Victor should not have based his decision off of Maddie's pregnancy."},{"premises":["If you're rude to people who hold a certain view, it means you don't respect that view.","Religion is a kind of personal preference.","You should be tolerant.","Respecting other people's preferences is a form of tolerance.","Eugene is rude to people who do not share his religion."],"intermediates":[{"inputs":["p0","p1"],"output":"If you're rude to people because of the religion they hold, it means you don't respect their religion."},{"inputs":["p2","p3"],"output":"You should respect other people's preferences."},{"inputs":["i1","p1"],"output":"You should respect other people's religious preferences."},{"inputs":["i0","i2"],"output":"You should not be rude to people because of the religion they hold."},{"inputs":["i3","p4"],"output":"Eugene should not be rude to people who do not share his religion."}],"hypothesis":"Eugene should not be rude to people who do not share his religion."},{"premises":["Intruding on people is disrespecting their privacy.","You should respect people's privacy.","Knocking on someone's door when they do not wish to be disturbed is intrusive.","Sandra constantly ignores \"No Solicitation\" signs and knocks on people's doors."],"intermediates":[{"inputs":["p0","p1"],"output":"You shouldn't intrude on people."},{"inputs":["p2","p3"],"output":"Sandra intrudes on people."},{"inputs":["i0","i1"],"output":"Sandra should not intrude on people."}],"hypothesis":"Sandra should not intrude on people."},{"premises":["Martin kicked his dog to make it stop barking.","Kicking an animal hurts it.","Hurting people or animals is considered abuse.","You should not abuse any living thing."],"intermediates":[{"inputs":["p0","p1"],"output":"Martin hurt his dog."},{"inputs":["p2","p3"],"output":"You should not hurt animals."},{"inputs":["i0","i1"],"output":"Martin should not have hurt his dog."}],"hypothesis":"Martin should not have hurt his dog."},{"premises":["If you think your college didn't prepare you for your job then you lack self-assurance in your abilities.","Cindy doesn't think her college was good enough for her current job. ","Confidence is a feeling of self-assurance arising from one's appreciation of one's own abilities or qualities.","Being confident allows you to feel ready for life's experiences.","It's important to feel ready for life's experiences."],"intermediates":[{"inputs":["p0","p1"],"output":"Cindy has a lack of self-assurance in her abilities."},{"inputs":["i0","p2"],"output":"Cindy lacks confidence."},{"inputs":["p3","p4"],"output":"It's important to be confident."},{"inputs":["i1","i2"],"output":"Cindy should try to be more confident."}],"hypothesis":"Cindy should try to be more confident."},{"premises":["Personal beliefs aren't a good reason to disobey the law.","The law stipulates you must report your income.","John did not report his income because he does not believe taxes are justified."],"intermediates":[{"inputs":["p0","p1"],"output":"Personal beliefs aren't a good reason to avoid reporting your income."},{"inputs":["i0","p2"],"output":"John should have reported his income."}],"hypothesis":"John should have reported his income."},{"premises":["Corey went to work while she was sick during a pandemic.","If you do something while sick you are prioritizing that thing over your health.","Everyone prioritizing health helps stop disease from spreading.","It's important to stop the spread of disease, especially when health risk is elevated.","A pandemic is a disease that is prevalent over a whole country or the world.","A disease that can effect the whole world escalates health risks for everyone."],"intermediates":[{"inputs":["p0","p1"],"output":"Corey prioritized work over her health during a pandemic."},{"inputs":["p2","p3"],"output":"Health should be everyone's priority, especially when health risk is elevated."},{"inputs":["p4","p5"],"output":"A pandemic escalates health risks for everyone."},{"inputs":["i1","i2"],"output":"During a pandemic, health should be everyone's top priority."},{"inputs":["i0","i3"],"output":"Corey had the wrong priorities."}],"hypothesis":"Corey had the wrong priorities."},{"premises":["Ryan made fun of Stew's favorite TV show in front of others.","If you are in front of others then you are in public.","Making fun of something that someone else likes can make that person feel ashamed and foolish.","To humiliate someone is to make someone feel ashamed and foolish by injuring their dignity and self-respect, especially publicly.","Humiliation is a form of harm.","You should not do something that harms someone else."],"intermediates":[{"inputs":["p0","p1"],"output":"Ryan made fun of Stew's favorite TV show in public."},{"inputs":["i0","p2"],"output":"Ryan made Stew feel ashamed and foolish in public."},{"inputs":["i1","p3"],"output":"Ryan humiliated Stew."},{"inputs":["p4","p5"],"output":"You should not humiliate someone else."},{"inputs":["i2","i3"],"output":"Ryan should not have humiliated Stew."}],"hypothesis":"Ryan should not have humiliated Stew."},{"premises":["Henry was dumped by Chloe and thought it was unfair of her so he is planning to deface her Facebook page.","If someone does something to you that feels unfair then you feel wronged by that person.","Defacing someone's social media page is a way of harming them.","Planning to inflict harm on someone for a wrong suffered at their hand is called seeking revenge.","It is better to heal than to hurt others.","When you feel wronged by someone, forgiving and forgetting is a way of healing."],"intermediates":[{"inputs":["p0","p1"],"output":"Henry felt wronged by Chloe and was planning to deface her Facebook page."},{"inputs":["i0","p2"],"output":"Henry felt wronged by Chloe and was planning to inflict harm on her."},{"inputs":["i1","p3"],"output":"Henry is seeking revenge."},{"inputs":["p4","p5"],"output":"When you feel wronged, it is better to forgive and forget than to hurt those who wronged you."},{"inputs":["i3","p3"],"output":"It is better to forgive and forget than to seek revenge."},{"inputs":["i2","i4"],"output":"Henry should forgive and forget instead of seeking revenge."}],"hypothesis":"Henry should forgive and forget instead of seeking revenge."},{"premises":["Slandering is damaging to a person's reputation.","Damaging someone's reputation is harmful to them.","You should not do something that harms someone else.","Paul slandered Jimmy in his magazine to increase sales."],"intermediates":[{"inputs":["p0","p1"],"output":"Slandering someone is harmful to them."},{"inputs":["i0","p2"],"output":"You should not slander someone."},{"inputs":["i1","p3"],"output":"Paul should not have slandered Jimmy."}],"hypothesis":"Paul should not have slandered Jimmy."},{"premises":["Mocking someone is intentionally aggravating them.","Intentionally aggravating someone is not encouraging positive discourse.","We should encourage positive discourse.","Walter mocked the rally participants because he disagreed with their political ideology."],"intermediates":[{"inputs":["p1","p2"],"output":"You shouldn't intentionally aggravate people."},{"inputs":["p0","i0"],"output":"You shouldn't mock people."},{"inputs":["i1","p3"],"output":"Walter should not have mocked the rally participants."}],"hypothesis":"Walter should not have mocked the rally participants."},{"premises":["You should not harm others.","Being considerate means you are careful to avoid hurting others.","If you do something that is inconvenient for others then you are being inconsiderate.","Justin quit his job after giving notice one day in advance.","Giving less than two weeks' notice before leaving your job is not enough warning.","Someone leaving their job without sufficient warning is inconvenient for their coworkers."],"intermediates":[{"inputs":["p0","p1"],"output":"You should be considerate."},{"inputs":["i0","p2"],"output":"You should not inconvenience others."},{"inputs":["p3","p4"],"output":"Justin did not give enough warning before quitting."},{"inputs":["i2","p5"],"output":"Justin quitting was inconvenient for his coworkers."},{"inputs":["i1","i3"],"output":"Justin should not have inconvenienced his coworkers."}],"hypothesis":"Justin should not have inconvenienced his coworkers."},{"premises":["If you're unreasonably angry at something taking too long, you're impatient.","Gabriel was angry at the server for taking too long even though the restaurant was understaffed.","When someone has to do a lot, it's reasonable for it to take a long time.","When a restaurant is understaffed, the servers have a lot to do.","People should be patient."],"intermediates":[{"inputs":["p2","p3"],"output":"When a restaurant is understaffed, it's reasonable for the servers to take a long time."},{"inputs":["p1","i0"],"output":"Gabriel was unreasonably angry that the server took too long."},{"inputs":["p0","i1"],"output":"Gabriel was impatient with the server."},{"inputs":["i2","p4"],"output":"Gabriel should have been patient with the server."}],"hypothesis":"Gabriel should have been patient with the server."},{"premises":["Luke let his partners handle the group project.","If you let other people handle something then you are not helping on that thing.","A group project requires multiple people to do work.","If multiple people are required to do something then it is expected that all those people should help.","You should be trustworthy.","To be trustworthy means you do what is expected of you."],"intermediates":[{"inputs":["p0","p1"],"output":"Luke did not help his partners on the group project."},{"inputs":["p2","p3"],"output":"It is expected that everyone on a group project will help."},{"inputs":["i0","i1"],"output":"Luke did not help his partners when it was expected."},{"inputs":["p4","p5"],"output":"If something is expected of you then you should do that thing."},{"inputs":["i2","i3"],"output":"Luke should have helped his partners."}],"hypothesis":"Luke should have helped his partners."},{"premises":["You should only conceive with someone with their consent.","Someone can't consent to something if they're being lied to about it.","Abby told Mark that she was on birth control so that she could get pregnant with him.","Abby was not on birth control."],"intermediates":[{"inputs":["p0","p1"],"output":"You shouldn't lie to someone in order to conceive with them."},{"inputs":["p2","p3"],"output":"Abby lied to Mark in order to get pregnant with him."},{"inputs":["i0","i1"],"output":"Abby should not have lied to Mark."}],"hypothesis":"Abby should not have lied to Mark."},{"premises":["A boss is an authority figure.","Tom spat in his boss's coffee in front of everyone.","Spitting in someone's beverage is rude.","Being insubordinate means disrespecting authority."],"intermediates":[{"inputs":["p1","p2"],"output":"Tom was rude to his boss."},{"inputs":["p0","i0"],"output":"Tom was being disrespectful towards an authority figure."},{"inputs":["i1","p3"],"output":"Tom was being insubordinate."}],"hypothesis":"Tom was being insubordinate."},{"premises":["Karen stole a customer's social security number for her own gain.","Stealing a person's social security number is also called stealing their identity.","You shouldn't cause problems for others.","Stealing someone's identity allows the thief to take control of the victim's bank account.","Losing control of your bank account leads to financial problems."],"intermediates":[{"inputs":["p0","p1"],"output":"Karen stole the customer's identity."},{"inputs":["p3","p4"],"output":"Stealing someone's identity can cause them financial problems."},{"inputs":["p2","i1"],"output":"You shouldn't steal someone's identity."},{"inputs":["i0","i2"],"output":"Karen should not have stolen the customer's identity."}],"hypothesis":"Karen should not have stolen the customer's identity."},{"premises":["Jenna's friend didn't give her permission to take any of her stuff.","Jenna took a Clif bar from the pantry.","Jenna's friend bought the Clif bars in the pantry.","Once you buy something, it belongs to you.","You shouldn't take someone else's belongings without their permission."],"intermediates":[{"inputs":["p2","p3"],"output":"The Clif bars in the pantry belonged to Jenna's friend."},{"inputs":["p1","i0"],"output":"Jenna took one of her friend's Clif bars."},{"inputs":["p0","i1"],"output":"Jenna took one of her friend's Clif bars without her permission."},{"inputs":["i2","p4"],"output":"Jenna shouldn't have taken the Clif bar."}],"hypothesis":"Jenna shouldn't have taken the Clif bar."},{"premises":["Rich deducted points from two students because they submitted the same project.","The project worksheet said that everyone was supposed to do the project on their own.","People working independently on a creative task will produce different results.","A school project is a creative task.","Deducting points from a student for violating rules is a valid response."],"intermediates":[{"inputs":["p2","p3"],"output":"People working independently on a school project will produce different results."},{"inputs":["p0","i0"],"output":"The two students must have worked together if they produced the same project."},{"inputs":["p1","i1"],"output":"The two students broke the rules by submitting the same project."},{"inputs":["p0","i2"],"output":"Rich deducted points from the students for breaking the rules."},{"inputs":["i3","p4"],"output":"Rich was right to deduct points from the students."}],"hypothesis":"Rich was right to deduct points from the students."},{"premises":["It's okay to sell lost items if you can't find their owner.","Jamie didn't try to find the camera's owner.","Jamie sold the camera on Ebay.","Losing something means leaving it somewhere accidentally.","People don't leave valuables in public on purpose.","Jamie found a camera sitting on a park bench.","Cameras don't put themselves on benches."],"intermediates":[{"inputs":["p3","p4"],"output":"If someone left a valuable item in public, they lost it."},{"inputs":["p5","p6"],"output":"Someone left the camera on the park bench."},{"inputs":["i0","i1"],"output":"Someone lost the camera."},{"inputs":["p2","i2"],"output":"Jamie sold a lost camera."},{"inputs":["p1","i3"],"output":"Jamie sold a lost camera without trying to find its owner first."},{"inputs":["p0","i4"],"output":"Jamie should have tried to find the camera's owner before selling it."}],"hypothesis":"Jamie should have tried to find the camera's owner before selling it."},{"premises":["Removing bad players from a competitive sports team because they are unskilled is okay.","A player performing poorly in a single game is not conclusive evidence that they are unskilled.","The other players on Cindy's soccer team voted to kick her off the team because she let three goals through in a playoff game.","A goalie's performance is reflected by the number of goals they let through.","Cindy is a goalie."],"intermediates":[{"inputs":["p0","p1"],"output":"A player's performance in one game isn't enough of a reason to remove them from a team."},{"inputs":["p3","p4"],"output":"The number of goals Cindy let through is a reflection of her performance."},{"inputs":["p2","i1"],"output":"The other players kicked Cindy off of the team based on her performance in a single game."},{"inputs":["i0","i2"],"output":"The other players shouldn't have kicked Cindy off the team."}],"hypothesis":"The other players shouldn't have kicked Cindy off the team."},{"premises":["You should not discriminate against people on the basis of sexuality.","Doing detrimental things to someone because of their identity is discrimination.","Removing someone from your will is detrimental to them.","Martin's father removed Martin from his will because Martin came out as gay."],"intermediates":[{"inputs":["p0","p1"],"output":"You should not do something detrimental to someone because of their sexuality."},{"inputs":["i0","p2"],"output":"You should not remove someone from your will because of their sexuality."},{"inputs":["i1","p3"],"output":"Martin's father should not have removed Martin from his will."}],"hypothesis":"Martin's father should not have removed Martin from his will."},{"premises":["Elaine slapped her brother because he ate the last two pudding cups.","Elaine felt she deserved one of the last two pudding cups.","It's petty to retaliate when someone wrongs you in a minor way.","Taking someone's snacks is wrong, but it doesn't harm them significantly.","You shouldn't hurt people for petty reasons."],"intermediates":[{"inputs":["p0","p1"],"output":"Elaine slapped her brother in retaliation for taking her snacks."},{"inputs":["p2","p3"],"output":"It's petty to retaliate against someone for taking your snacks."},{"inputs":["i0","i1"],"output":"Elaine slapped her brother for a petty reason."},{"inputs":["i2","p4"],"output":"Elaine should not have slapped her brother."}],"hypothesis":"Elaine should not have slapped her brother."},{"premises":["You shouldn't insult people for no good reason.","Someone's appearance is not a good reason to insult them.","Calling something dirty is an insult.","Dishrags are stereotypically dirty.","Comparing things implies that they share properties.","Derek told Cammy that her hair looked like a dishrag.","Someone's hair is part of their appearance."],"intermediates":[{"inputs":["p3","p4"],"output":"Comparing something to a dishrag implies that it's dirty."},{"inputs":["i0","p5"],"output":"Derek's comment was implying that Cammy's hair looked dirty."},{"inputs":["p2","i1"],"output":"Derek's comment was an insult."},{"inputs":["p6","p5"],"output":"Derek's comment was about Cammy's appearance."},{"inputs":["i2","i3"],"output":"Derek insulted Cammy's appearance."},{"inputs":["p1","i4"],"output":"Derek insulted Cammy for no good reason."},{"inputs":["p0","i5"],"output":"Derek should not have insulted Cammy."}],"hypothesis":"Derek should not have insulted Cammy."},{"premises":["You should be polite.","Melanie closed the doors immediately when she saw someone approaching the elevator she was in.","It's polite to hold the door for people."],"intermediates":[{"inputs":["p1","p2"],"output":"It was impolite for Melanie to close the elevator doors."},{"inputs":["p0","i0"],"output":"Melanie shouldn't have closed the elevator doors."}],"hypothesis":"Melanie shouldn't have closed the elevator doors."},{"premises":["You should avoid doing unethical things.","Bribing someone to do something wrong is unethical.","It's wrong to keep quiet about misconduct.","Offering someone something valuable in exchange for their cooperation is bribery.","Jarad's project manager Mike offered him tickets to a sold-out concert in exchange for not discussing Mike's behavior in the office during an HR inquiry."],"intermediates":[{"inputs":["p1","p2"],"output":"Bribing someone to keep quiet about misconduct is unethical."},{"inputs":["p3","p4"],"output":"Mike was attempting to bribe Jarad to keep quiet about his misconduct by offering him the tickets."},{"inputs":["i0","i1"],"output":"It was unethical for Mike to offer Jarad the tickets."},{"inputs":["p0","i2"],"output":"Mike should not have offered Jarad the tickets."}],"hypothesis":"Mike should not have offered Jarad the tickets."},{"premises":["If someone asks you for a small favor, it's polite to accept.","Letting someone use the shower before you is a small favor.","Elle's sister asked her if she could use the shower first.","Elle ignored her sister's request and showered for 30 minutes.","You should be polite."],"intermediates":[{"inputs":["p1","p2"],"output":"Elle's sister was requesting a small favor."},{"inputs":["i0","p3"],"output":"Elle ignored her sister's request for a small favor."},{"inputs":["p0","i1"],"output":"It was impolite for Elle to ignore her sister's request."},{"inputs":["i2","p4"],"output":"Elle should not have ignored her sister's request."}],"hypothesis":"Elle should not have ignored her sister's request."},{"premises":["It's okay to do things that are generally frowned upon if they have positive outcomes.","Lying is generally wrong.","Xirong lied to his boss to protect his coworker from being fired for organizing a walk-out.","Firing someone for organizing a walk-out is a form of retaliation.","Preventing someone from doing something wrong is a good thing.","Retaliating against worker organization is wrong."],"intermediates":[{"inputs":["p0","p1"],"output":"It's okay to lie if it does more good than harm."},{"inputs":["p2","p3"],"output":"Xirong lied to his boss to prevent him from retaliating against worker organization."},{"inputs":["p4","p5"],"output":"Preventing someone from retaliating against worker organization is a good thing."},{"inputs":["i1","i2"],"output":"The consequence of Xirong's lie was a good thing."},{"inputs":["i0","i3"],"output":"It was okay for Xirong to lie to his boss."}],"hypothesis":"It was okay for Xirong to lie to his boss."},{"premises":["Dita cut the brakes on Martin's car after he cheated on her.","Someone cheating on you is not a good enough reason to put them in mortal danger.","Cutting the brakes on someone's car puts them in mortal danger."],"intermediates":[{"inputs":["p1","p2"],"output":"Someone cheating on you is not a good enough reason to cut the brakes on their car."},{"inputs":["p0","i0"],"output":"Dita should not have cut the brakes on Martin's car."}],"hypothesis":"Dita should not have cut the brakes on Martin's car."},{"premises":["It's okay to break rules that aren't important.","Movie theater rules say that no outside food is allowed.","Rules about not bringing outside food into establishments exist to increase on-site concession sales.","Increasing on-site concession sales isn't important.","Sam broke the theater rules by bringing chips into the movie."],"intermediates":[{"inputs":["p2","p3"],"output":"Rules about not bringing food into establishments aren't important."},{"inputs":["p1","i0"],"output":"The movie theater rule that says no outside food is allowed is not important."},{"inputs":["p0","i1"],"output":"It's okay to break the movie theater rule that says no outside food is allowed."},{"inputs":["i2","p4"],"output":"It was okay for Sam to take the chips into the theater."}],"hypothesis":"It was okay for Sam to take the chips into the theater."},{"premises":["A physical response to a remark is escalation.","Luis dumped his soda on the guy sitting in front of him because the guy made a snide remark about Ravens fans.","You shouldn't escalate conflicts."],"intermediates":[{"inputs":["p0","p1"],"output":"Luis escalated the situation by dumping his soda on the guy."},{"inputs":["i0","p2"],"output":"Luis shouldn't have dumped his soda on the guy."}],"hypothesis":"Luis shouldn't have dumped his soda on the guy."},{"premises":["Esme copied a section of the Wikipedia article on Thomas Jefferson to put in her school report.","If you copy something without attribution, you're representing it as your own work.","Esme didn't attribute the copied section.","Copying someone else's writing and representing it as your own work is plagiarism.","Plagiarism is wrong."],"intermediates":[{"inputs":["p1","p2"],"output":"Esme represented the copied section as her own work."},{"inputs":["p0","i0"],"output":"Esme copied someone else's writing from Wikipedia and represented it as her own work."},{"inputs":["p3","p4"],"output":"Copying someone else's writing and representing it as your own work is wrong."},{"inputs":["i1","i2"],"output":"Esme shouldn't have copied from Wikipedia without attributing the copied section."}],"hypothesis":"Esme shouldn't have copied from Wikipedia without attributing the copied section."},{"premises":["You shouldn't induce people to help you do bad things.","Cheating is wrong.","Faking drug test results in competitive sports is cheating.","Giles paid his friend for a urine sample to pass a drug test for a crew competition.","Using someone else's urine to pass a drug test is faking."],"intermediates":[{"inputs":["p1","p2"],"output":"Faking drug test results in competitive sports is wrong."},{"inputs":["p3","p4"],"output":"Giles paid his friend for the sample to help him fake a drug test for a crew competition."},{"inputs":["i0","i1"],"output":"Giles paid his friend for the sample to help him do something wrong."},{"inputs":["p0","i2"],"output":"Giles shouldn't have paid his friend for the sample."}],"hypothesis":"Giles shouldn't have paid his friend for the sample."},{"premises":["A store is a public location.","It's polite to cover your mouth when coughing in a public location.","Rajesh coughed without covering his mouth in line at the drugstore."],"intermediates":[{"inputs":["p0","p1"],"output":"It's polite to cover your mouth when coughing in a store."},{"inputs":["i0","p2"],"output":"Rajesh should have covered his mouth."}],"hypothesis":"Rajesh should have covered his mouth."},{"premises":["It's okay to lie if it does more good than harm.","Marina told her parents that she was going to be staying over at a friend's house.","In reality, she was going to be at an all-night house party.","You're lying to someone if you tell them you're planning one thing but you're really planning something else.","Lying to someone that you're not doing something dangerous prevents them from helping you in an emergency.","Partying is potentially dangerous.","Preventing someone from helping you in an emergency is potentially very harmful."],"intermediates":[{"inputs":["p1","p2"],"output":"Marina told her parents she wouldn't be at a party, but she was actually going to a house party."},{"inputs":["i0","p3"],"output":"Marina lied to her parents to give them the impression she wouldn't be going to a house party."},{"inputs":["p4","p5"],"output":"Lying to someone that you're not partying prevents them from helping you in an emergency."},{"inputs":["i2","p6"],"output":"Lying to someone that you're not partying does more harm than good."},{"inputs":["i1","i3"],"output":"Marina's lie to her parents did more harm than good."},{"inputs":["p0","i4"],"output":"Marina shouldn't have lied to her parents."}],"hypothesis":"Marina shouldn't have lied to her parents."},{"premises":["Bugging someone's phone is an invasion of their privacy.","Invading people's privacy without a good reason is wrong.","Omar bugged his girlfriend's phone because he thought she was lying.","Omar suspected his girlfriend was lying because she came home at 3 AM.","It's normal to be out late when you're drinking with friends.","Omar's girlfriend told him she was going out drinking with her friends.","It's irrational to be suspicious of someone who is behaving normally."],"intermediates":[{"inputs":["p0","p1"],"output":"Bugging someone's phone without a good reason is wrong."},{"inputs":["p4","p5"],"output":"It was normal for Omar's girlfriend to be out late."},{"inputs":["p3","i1"],"output":"Omar suspected his girlfriend was lying because she did something normal."},{"inputs":["i2","p6"],"output":"Omar didn't have good reason to suspect his girlfriend was lying."},{"inputs":["p2","i3"],"output":"Omar bugged his girlfriend's phone without a good reason."},{"inputs":["i0","i4"],"output":"Omar shouldn't have bugged his girlfriend's phone."}],"hypothesis":"Omar shouldn't have bugged his girlfriend's phone."},{"premises":["It's inappropriate for supervisors to behave unprofessionally.","It's unprofessional to let personal matters interfere with workplace matters.","An employer's influence over their employees' pay is a workplace matter.","Alan docked Tim's pay because Tim gave Alan's daughter a low score on a test.","Doing something because of a familial relationship is doing it for a personal reason."],"intermediates":[{"inputs":["p1","p2"],"output":"It's unprofessional to dock your employee's pay for personal reasons."},{"inputs":["p3","p4"],"output":"Alan docked Tim's pay for a personal reason."},{"inputs":["i0","i1"],"output":"It was unprofessional for Alan to dock Tim's pay."},{"inputs":["p0","i2"],"output":"Alan should not have docked Tim's pay."}],"hypothesis":"Alan should not have docked Tim's pay."},{"premises":["You should not inconvenience people.","Preetha parked in front of her neighbor's car, blocking them in their shared driveway.","It's inconvenient to have your car blocked."],"intermediates":[{"inputs":["p1","p2"],"output":"Preetha parking in front of her neighbor's car inconvenienced her neighbor."},{"inputs":["p0","i0"],"output":"Preetha should not have parked in front of her neighbor's car."}],"hypothesis":"Preetha should not have parked in front of her neighbor's car."},{"premises":["It's rude to spoil a show.","You shouldn't be rude.","Spoiling something means revealing a detail to someone before they get a chance to learn it for themselves.","Dane told Demarcus how the show ended before Demarcus got a chance to finish watching it."],"intermediates":[{"inputs":["p0","p1"],"output":"You shouldn't spoil shows for people."},{"inputs":["p2","p3"],"output":"Dane spoiled the show for Demarcus."},{"inputs":["i0","i1"],"output":"Dane should not have spoiled the show for Demarcus."}],"hypothesis":"Dane should not have spoiled the show for Demarcus."},{"premises":["You should only call emergency services in an emergency.","The police are an emergency service.","Alina called the police on some teenagers who were sitting across the street from her house because she thought they looked suspicious.","Seeing someone who you think looks suspicious is not an emergency."],"intermediates":[{"inputs":["p0","p1"],"output":"You should only call the police in an emergency."},{"inputs":["p2","p3"],"output":"Alina was not in an emergency when she called the police."},{"inputs":["i0","i1"],"output":"Alina shouldn't have called the police."}],"hypothesis":"Alina shouldn't have called the police."},{"premises":["You should generally follow the law.","Darrel bought a 48-rack of beer for his highschool nephew's friend.","People in highschool mostly have highschool-aged friends.","Supplying minors with alcohol is illegal."],"intermediates":[{"inputs":["p2","p1"],"output":"Darrel's nephew's friend was probably a minor."},{"inputs":["p1","i0"],"output":"Darrel was probably buying the beer for a minor."},{"inputs":["i1","p3"],"output":"It was probably illegal for Darrel to buy the beer."},{"inputs":["p0","i2"],"output":"Darrel shouldn't have bought the beer."}],"hypothesis":"Darrel shouldn't have bought the beer."},{"premises":["It's rude to interrupt people.","You shouldn't be rude.","Miguel interrupted the song that Alice was listening to on the wireless speaker to play his song."],"intermediates":[{"inputs":["p0","p1"],"output":"You shouldn't interrupt people."},{"inputs":["i0","p2"],"output":"Miguel shouldn't have interrupted Alice's song."}],"hypothesis":"Miguel shouldn't have interrupted Alice's song."},{"premises":["Foods that contain a lot of sugar are unhealthy.","Monica refused to get her son Froot Loops because she thought they were too sugary.","It's okay to refuse to do something if you have a good reason.","It's a good idea to prevent your children from eating unhealthy food."],"intermediates":[{"inputs":["p0","p1"],"output":"Monica refused to get her son Froot Loops because she thought they were unhealthy."},{"inputs":["p2","p3"],"output":"It's okay to refuse to give your children unhealthy food."},{"inputs":["i0","i1"],"output":"It was okay for Monica to refuse to get her son Froot Loops."}],"hypothesis":"It was okay for Monica to refuse to get her son Froot Loops."},{"premises":["Tax fraud is inadvisable.","Writing personal purchases off as business expenses is tax fraud.","Patrice bought himself a jacuzzi and wrote it off as a business expense."],"intermediates":[{"inputs":["p1","p2"],"output":"Writing the jacuzzi off as a business expense was tax fraud."},{"inputs":["p0","i0"],"output":"Patrice should not have written off the jacuzzi."}],"hypothesis":"Patrice should not have written off the jacuzzi."},{"premises":["Spiking someone's drink is a very bad thing to do.","If someone does something bad to you, it makes sense to want to avoid them.","Elena told her friends to cut ties with Pat after he spiked her drink.","If you don't want social contact with someone, your friends also need to stop associating with them."],"intermediates":[{"inputs":["p0","p1"],"output":"If someone spikes your drink, it makes sense to want to avoid them."},{"inputs":["i0","p2"],"output":"Elena was justified in wanting to avoid Pat."},{"inputs":["p2","p3"],"output":"If Elena didn't want social contact with Pat, her friends would also need to stop associating with him."},{"inputs":["i1","i2"],"output":"Elena was justified in telling her friends to cut ties with Pat."}],"hypothesis":"Elena was justified in telling her friends to cut ties with Pat."},{"premises":["When you hit someone's car, you should leave a note.","Biff backed into someone in the parking lot, then drove away without stopping.","If you don't stop your car, you can't get out and leave a note."],"intermediates":[{"inputs":["p1","p2"],"output":"Biff hit someone's car but didn't leave a note."},{"inputs":["p0","i0"],"output":"Biff should have left a note."}],"hypothesis":"Biff should have left a note."},{"premises":["You should pay attention to people when they're talking to you.","If you're ignoring someone, you aren't paying attention to them.","Terry pretended to not be able to hear Michelle because she wouldn't agree with his dinner plan.","If you're pretending not to hear someone, you're ignoring them."],"intermediates":[{"inputs":["p0","p1"],"output":"You shouldn't ignore people."},{"inputs":["p2","p3"],"output":"Terry ignored Michelle."},{"inputs":["i0","i1"],"output":"Terry shouldn't have ignored Michelle."}],"hypothesis":"Terry shouldn't have ignored Michelle."}]